```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.aws_hosted_react_cloudfront_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_hosted_react_cloudfront_policy_doc" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               "arn:aws:s3:::aws-hosted-react-production/*",
            ]

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # aws_cloudfront_distribution.cf_distribution will be created
+   resource "aws_cloudfront_distribution" "cf_distribution" {
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = true
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = true
+       status                         = (known after apply)
+       tags_all                       = (known after apply)
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 403
+           response_code         = 200
+           response_page_path    = "/index.html"
        }
+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 404
+           response_code         = 200
+           response_page_path    = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 3600
+           max_ttl                = 86400
+           min_ttl                = 0
+           target_origin_id       = "aws-hosted-react-production"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       ordered_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           compress               = true
+           default_ttl            = 0
+           max_ttl                = 0
+           min_ttl                = 0
+           path_pattern           = "/index.html"
+           target_origin_id       = "aws-hosted-react-production"
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward = "none"
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = "aws-hosted-react-production.s3.amazonaws.com"
+           origin_id           = "aws-hosted-react-production"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_identity.oai will be created
+   resource "aws_cloudfront_origin_access_identity" "oai" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "React App OAI"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # aws_s3_bucket_acl.app_bucket_acl will be destroyed
  # (because aws_s3_bucket_acl.app_bucket_acl is not in configuration)
-   resource "aws_s3_bucket_acl" "app_bucket_acl" {
-       acl    = "public-read" -> null
-       bucket = "aws-hosted-react-production" -> null
-       id     = "aws-hosted-react-production,public-read" -> null

-       access_control_policy {
-           grant {
-               permission = "READ" -> null

-               grantee {
-                   type = "Group" -> null
-                   uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
-           grant {
-               permission = "FULL_CONTROL" -> null

-               grantee {
-                   display_name = "mabe.abby.a" -> null
-                   id           = "e0c8bb913d6a77c937ee98e33b16d1f55298e6d718a522c806cdd7f721042cfb" -> null
-                   type         = "CanonicalUser" -> null
                }
            }

-           owner {
-               display_name = "mabe.abby.a" -> null
-               id           = "e0c8bb913d6a77c937ee98e33b16d1f55298e6d718a522c806cdd7f721042cfb" -> null
            }
        }
    }

  # aws_s3_bucket_policy.aws_hosted_react_cloudfront_policy will be created
+   resource "aws_s3_bucket_policy" "aws_hosted_react_cloudfront_policy" {
+       bucket = "aws-hosted-react-production"
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.block_public_access will be created
+   resource "aws_s3_bucket_public_access_block" "block_public_access" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = "aws-hosted-react-production"
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # aws_s3_bucket_website_configuration.app_bucket_web_config will be destroyed
  # (because aws_s3_bucket_website_configuration.app_bucket_web_config is not in configuration)
-   resource "aws_s3_bucket_website_configuration" "app_bucket_web_config" {
-       bucket           = "aws-hosted-react-production" -> null
-       id               = "aws-hosted-react-production" -> null
-       website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
-       website_endpoint = "aws-hosted-react-production.s3-website-us-east-1.amazonaws.com" -> null

-       error_document {
-           key = "index.html" -> null
        }

-       index_document {
-           suffix = "index.html" -> null
        }
    }

  # aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "asset-manifest.json"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "favicon.ico"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "index.html"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["logo192.png"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "logo192.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["logo512.png"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "logo512.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "manifest.json"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["robots.txt"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "robots.txt"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/css/main.22941023.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/css/main.22941023.css.map"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/css/main.22941023.css.map"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js.LICENSE.txt"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.static_files["static/js/main.9ba1114e.js.map"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ acl                = "public-read" -> "private"
        id                 = "static/js/main.9ba1114e.js.map"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 12 to change, 2 to destroy.

Changes to Outputs:
-   website_endpoint = "aws-hosted-react-production.s3-website-us-east-1.amazonaws.com" -> null
```